(01)cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//For Reynolds number of 10:
//Dimension of nu is [m^2 / s] and the amount of kinematic viscosity is 0.01.
nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;
//For an icoFoam case, the only property that must be specified is the kinematic viscosity.

// ************************************************************************* //
